Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.NumericInputHandlerImports
Wrapper class for Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputHandler imports.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.NumericInputHandlerImports.DotExportNumericInputRequestConsumed(Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Notifies when the numeric input will be handled.
requestConsumed: True on consumed; otherwise, false.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.NumericInputHandlerImports.DotExportNumericInputConsumed(Tekla.Structures.DirectManipulation.Adapter.Native.dotBool)
Notifies when the Tekla.Structures.DirectManipulation.Adapter.EventRegistry.InputEvents.NumericInputCompleted event has been consumed.
requestConsumed: True on consumed; otherwise, false.
Returns: True on success; otherwise, false.

Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.NumericInputHandlerImports.DotExportGetNumericInputValues(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputData@)
Gets the inputted string from TS core.
inputValue: The inputted string.
Returns: True on success; otherwise, false.